Methodology/Topics/DDPs/OM/ManageResourceInventory/v1-0/xml/http/getAllManagedElements.xml

<?xml version="1.0" encoding="UTF-8"?>
<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" xmlns="tmforum.mtop.om-mri.v1-0" xmlns:bsc="tmforum.mtop.dm-basic.v1-0" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xsi:schemaLocation="tmforum.mtop.om-mri.v1-0 ..\..\xsd\MeRetrieval.xsd tmforum.mtop.dm-basic.v1-0 ..\..\..\..\..\DM\Basic\v1-0\xsd\MessageDefinitions.xsd http://schemas.xmlsoap.org/soap/envelope/ http://schemas.xmlsoap.org/soap/envelope/">
  <soap:Header>
    <bsc:header>
      <bsc:activityName>getAllManagedElements</bsc:activityName>
      <bsc:msgName>getAllManagedElements</bsc:msgName>
      <bsc:msgType>REQUEST</bsc:msgType>
      <bsc:correlationId>0001</bsc:correlationId>
      <bsc:senderURI>http://inventoryOS</bsc:senderURI>
      <bsc:destinationURI>http://ems/ManageResourceInventory</bsc:destinationURI>
      <bsc:communicationPattern>MultipleBatchResponse</bsc:communicationPattern>
      <bsc:communicationStyle>RPC</bsc:communicationStyle>
      <bsc:requestedBatchSize>100</bsc:requestedBatchSize>
      <bsc:timestamp>20051004140305</bsc:timestamp>
    </bsc:header>
  </soap:Header>
  <soap:Body>
    <getAllManagedElements>
      <bsc:vendorExtensions>
        <joe.v1.meExt xmlns:joe.v1="http://www.joe.com/schema/MeExtV1.xsd">
          <joe.v1.test>string</joe.v1.test>
          <joe.v1.security>string</joe.v1.security>
        </joe.v1.meExt>
        <jane.meExt xmlns:jane="http://www.jane.com/schema/MeExt.xsd">
          <jane.data>string</jane.data>
        </jane.meExt>
      </bsc:vendorExtensions>
      <mdName>
        <bsc:mdNm>String</bsc:mdNm>
      </mdName>
    </getAllManagedElements>
  </soap:Body>
</soap:Envelope>
